Revit 2027 API
Panel.FindHostPanel Method
 Finds the id of the host panel (i.e., wall) associated with this panel. If a host panel is present, then it is displayed instead of the curtain panel.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId FindHostPanel()
Public Function FindHostPanel As ElementId
public:
ElementId^ FindHostPanel()
member FindHostPanel : unit -> ElementId
Return Value
ElementId
Element id of the host panel associated with this panel. Otherwise, InvalidElementId is returned
See Also
Reference
Panel Class
Autodesk.Revit.DB Namespace